# Subquery

In [ ]:
import mysql.connector
import pandas as pd

In [33]:
connection  = mysql.connector.connect(host="localhost",user="root",password="root",database="exl")

In [34]:
connection

Q1.	From the following table, write a SQL query to find out which employees have the same designation as the employee whose ID is 169. Return first name, last name, department ID and job ID.

In [25]:
query = """SELECT first_name, last_name, department_id, job_id
FROM  employees
WHERE job_id = (SELECT job_id 
                FROM employees
                WHERE employee_id = 169);"""
data = pd.read_sql(query, connection)
print(data)

# connection.close()

     first_name   last_name  department_id  job_id
0        Renske      Ladwig             80  SA_REP
1       Stephen      Stiles             80  SA_REP
2          John         Seo             80  SA_REP
3        Joshua       Patel             80  SA_REP
4        Trenna        Rajs             80  SA_REP
5        Curtis      Davies             80  SA_REP
6       Randall       Matos             80  SA_REP
7         Peter      Vargas             80  SA_REP
8          John     Russell             80  SA_REP
9         Karen    Partners             80  SA_REP
10      Alberto   Errazuriz             80  SA_REP
11       Gerald   Cambrault             80  SA_REP
12        Eleni     Zlotkey             80  SA_REP
13        Peter      Tucker             80  SA_REP
14        David   Bernstein             80  SA_REP
15        Peter        Hall             80  SA_REP
16  Christopher       Olsen             80  SA_REP
17      Nanette   Cambrault             80  SA_REP
18       Oliver     Tuvault             80  SA_REP
19      Janette        King             80  SA_REP
20      Patrick       Sully             80  SA_REP
21        Allan      McEwen             80  SA_REP
22      Lindsey       Smith             80  SA_REP
23       Louise       Doran             80  SA_REP
24       Sarath      Sewall             80  SA_REP
25        Clara     Vishney             80  SA_REP
26     Danielle      Greene             80  SA_REP
27       Mattea     Marvins             80  SA_REP
28        David         Lee             80  SA_REP
29       Sundar        Ande             80  SA_REP
30         Amit       Banda             80  SA_REP
31         Lisa        Ozer             80  SA_REP
32     Harrison       Bloom             80  SA_REP
33       Tayler         Fox             80  SA_REP
34      William       Smith             80  SA_REP
35    Elizabeth       Bates             80  SA_REP
36      Sundita       Kumar             80  SA_REP
37        Ellen        Abel             80  SA_REP
38       Alyssa      Hutton             80  SA_REP
39     Jonathon      Taylor             80  SA_REP
40         Jack  Livingston             80  SA_REP
41    Kimberely       Grant             80  SA_REP
42      Charles     Johnson             80  SA_REP

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\3518623245.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query, connection)

Q2.From the following table, write a SQL query to find those employees whose salary matches the lowest salary of any of the departments.Return first name, last name and department ID.

In [26]:
query = """SELECT first_name, last_name, department_id
FROM employees
WHERE salary IN (SELECT min(salary) 
                 FROM  employees 
                 GROUP BY department_id);"""
data = pd.read_sql(query, connection)
print(data)

   first_name   last_name  department_id
0       Neena     Kochhar             90
1         Lex     De Haan             90
2       Bruce       Ernst             60
3       Diana     Lorentz             60
4        Luis        Popp            100
5       Karen  Colmenares             30
6      Shanta     Vollman             50
7      Steven      Markle             50
8       James      Marlow             50
9          TJ       Olson             50
10      Hazel  Philtanker             80
11     Joshua       Patel             80
12      Peter      Vargas             80
13      Peter      Tucker             80
14    Janette        King             80
15      Clara     Vishney             80
16   Danielle      Greene             80
17   Harrison       Bloom             80
18     Martha    Sullivan             50
19    Nandita    Sarchand             50
20    Randall     Perkins             50
21   Jennifer      Whalen             10
22        Pat         Fay             20
23      Susan      Mavris             40
24    Hermann        Baer             70
25    William       Gietz            110

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\3232394370.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query, connection)

Q3. From the following tables, write a SQL query to find those employees who work in the same department as ‘Clara’. 
Exclude all those records where first name is ‘Clara’. Return first name, last name and hire date.

In [27]:
query = """SELECT first_name, last_name, hire_date
FROM employees
WHERE department_id = (SELECT department_id
						FROM employees
                        WHERE first_name='Clara' )
AND first_name != 'Clara';"""
data = pd.read_sql(query, connection)
print(data)

     first_name   last_name   hire_date
0         Jason      Mallin  2004-06-14
1       Michael      Rogers  2006-08-26
2            Ki         Gee  2007-12-12
3         Hazel  Philtanker  2008-02-06
4        Renske      Ladwig  2003-07-14
5       Stephen      Stiles  2005-10-26
6          John         Seo  2006-02-12
7        Joshua       Patel  2006-04-06
8        Trenna        Rajs  2003-10-17
9        Curtis      Davies  2005-01-29
10      Randall       Matos  2006-03-15
11        Peter      Vargas  2006-07-09
12         John     Russell  2004-10-01
13        Karen    Partners  2005-01-05
14      Alberto   Errazuriz  2005-03-10
15       Gerald   Cambrault  2007-10-15
16        Eleni     Zlotkey  2008-01-29
17        Peter      Tucker  2003-01-30
18        David   Bernstein  2005-03-24
19        Peter        Hall  2005-08-20
20  Christopher       Olsen  2006-03-30
21      Nanette   Cambrault  2006-12-09
22       Oliver     Tuvault  2007-11-23
23      Janette        King  2004-01-30
24      Patrick       Sully  2004-03-04
25        Allan      McEwen  2004-08-01
26      Lindsey       Smith  2005-03-10
27       Louise       Doran  2005-12-15
28       Sarath      Sewall  2006-11-03
29     Danielle      Greene  2002-03-19
30       Mattea     Marvins  2003-05-07
31        David         Lee  2005-01-19
32       Sundar        Ande  2006-03-24
33         Amit       Banda  2006-05-21
34         Lisa        Ozer  2007-03-11
35     Harrison       Bloom  2006-03-23
36       Tayler         Fox  2006-01-24
37      William       Smith  2007-02-23
38    Elizabeth       Bates  2007-03-24
39      Sundita       Kumar  2008-04-21
40        Ellen        Abel  2004-05-11
41       Alyssa      Hutton  2006-03-19
42     Jonathon      Taylor  2006-06-24
43         Jack  Livingston  2006-04-23
44    Kimberely       Grant  2007-05-24
45      Charles     Johnson  2008-01-04

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\3723135857.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query, connection)

Q4. From the following tables, write a SQL query to find those employees who work in a department where the employee’s  first name contains the letter 'T'. Return employee ID, first name and last name.

In [28]:
query = """SELECT first_name, last_name
FROM employees
WHERE department_id IN (SELECT department_id 
						FROM employees 
						WHERE first_name LIKE '%T%' );"""
data = pd.read_sql(query, connection)
print(data)

   first_name  last_name
0      Steven       King
1       Neena    Kochhar
2         Lex    De Haan
3     Matthew      Weiss
4        Adam      Fripp
..        ...        ...
80      Kevin     Feeney
81     Donald   OConnell
82    Douglas      Grant
83    Michael  Hartstein
84        Pat        Fay

[85 rows x 2 columns]

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\3113636094.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query, connection)

Q5. From the following table, write a SQL query to find those employees whose salary is lower than that of employees whose job title is ‘MK_MAN’. Return employee ID, first name, last name, job ID.

In [29]:
query = """SELECT employee_id, first_name, last_name, job_id
FROM employees
where salary < (SELECT max(salary) 
				FROM  employees 
				WHERE job_id='MK_MAN');"""
data = pd.read_sql(query, connection)
print(data)

     employee_id first_name  last_name      job_id
0            103  Alexander     Hunold     IT_PROG
1            104      Bruce      Ernst     IT_PROG
2            105      David     Austin     IT_PROG
3            106      Valli  Pataballa     IT_PROG
4            107      Diana    Lorentz     IT_PROG
..           ...        ...        ...         ...
96           202        Pat        Fay      MK_REP
97           203      Susan     Mavris      HR_REP
98           204    Hermann       Baer      PR_REP
99           205    Shelley    Higgins      AC_MGR
100          206    William      Gietz  AC_ACCOUNT

[101 rows x 4 columns]

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\3088612359.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query, connection)

Q6. Write a query to display the employee id, name ( first name and last name ) and the job id column with a modified title SALESMAN for those employees whose job title is ST_MAN and DEVELOPER for whose job title is IT_PROG.

In [30]:
query = """SELECT 
    employee_id, 
    CONCAT(first_name, ' ', last_name) AS name, 
    salary,
    CASE 
        WHEN salary > (SELECT AVG(salary) FROM employees) THEN 'HIGH'
        WHEN salary < (SELECT AVG(salary) FROM employees) THEN 'LOW'
    END AS SalaryStatus
FROM employees;


SELECT 
    employee_id, 
    CONCAT(first_name, ' ', last_name) AS name, 
    CASE 
        WHEN job_id = 'ST_MAN' THEN 'SALESMAN'
        WHEN job_id = 'IT_PROG' THEN 'DEVELOPER'
        ELSE job_id 
    END AS modified_job_title,
    salary
FROM employees;"""
data = pd.read_sql(query, connection)
print(data)

     employee_id              name   salary SalaryStatus
0            100       Steven King  24000.0         HIGH
1            101     Neena Kochhar  17000.0         HIGH
2            102       Lex De Haan  17000.0         HIGH
3            103  Alexander Hunold   9000.0         HIGH
4            104       Bruce Ernst   6000.0          LOW
..           ...               ...      ...          ...
102          202           Pat Fay   6000.0          LOW
103          203      Susan Mavris   6500.0         HIGH
104          204      Hermann Baer  10000.0         HIGH
105          205   Shelley Higgins  12000.0         HIGH
106          206     William Gietz   8300.0         HIGH

[107 rows x 4 columns]

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\3051443695.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query, connection)

Q7. From the following table, write a SQL query to find all those departments where at least one employee is employed. Return department name.

In [35]:
query1 = """SELECT department_name 
FROM departments
where department_id IN(SELECT DISTINCT(department_id) 
						FROM employees);"""
data = pd.read_sql(query1, connection)
print(data)

     department_name
0     Administration
1          Marketing
2         Purchasing
3    Human Resources
4           Shipping
5                 IT
6   Public Relations
7              Sales
8          Executive
9            Finance
10        Accounting

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\1280266608.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query1, connection)

Q8. From the following tables, write a SQL query to find those departments that are locatedin the city of London. Return department ID, department name.

In [37]:
query1 = """ SELECT department_id, department_name
 FROM departments
 WHERE location_id = (SELECT location_id 
						FROM locations 
                        where city = 'London');"""
data = pd.read_sql(query1, connection)
print(data)

   department_id  department_name
0             40  Human Resources

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\1370479764.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query1, connection)

Q9. From the following table, write a SQL query to find those employees who earn more than the average salary. Sort the result-set in descending order by salary. Return first name, last name, salary, and department ID.

In [39]:
query1 = """SELECT first_name, last_name, department_id
 FROM employees
 WHERE salary>(SELECT AVG(salary) 
                FROM employees) 
ORDER BY salary DESC;"""
data = pd.read_sql(query1, connection)
print(data)

     first_name   last_name  department_id
0        Steven        King             90
1         Neena     Kochhar             90
2           Lex     De Haan             90
3          John     Russell             80
4         Karen    Partners             80
5       Michael   Hartstein             20
6         Nancy   Greenberg            100
7       Alberto   Errazuriz             80
8       Shelley     Higgins            110
9          Lisa        Ozer             80
10        Ellen        Abel             80
11          Den    Raphaely             30
12       Gerald   Cambrault             80
13        Eleni     Zlotkey             80
14     Harrison       Bloom             80
15      Janette        King             80
16        Peter      Tucker             80
17      Hermann        Baer             70
18       Tayler         Fox             80
19      Patrick       Sully             80
20        David   Bernstein             80
21    Alexander      Hunold             60
22       Daniel      Faviet            100
23        Allan      McEwen             80
24        Peter        Hall             80
25       Alyssa      Hutton             80
26     Jonathon      Taylor             80
27         Jack  Livingston             80
28      William       Gietz            110
29         Adam       Fripp             50
30         John        Chen            100
31      Matthew       Weiss             50
32  Christopher       Olsen             80
33      Lindsey       Smith             80
34        Payam    Kaufling             50
35  Jose Manuel       Urman            100
36       Ismael     Sciarra            100
37      Nanette   Cambrault             80
38       Louise       Doran             80
39      William       Smith             80
40    Elizabeth       Bates             80
41       Sarath      Sewall             80
42       Oliver     Tuvault             80
43    Kimberely       Grant             80
44         Luis        Popp            100
45        Clara     Vishney             80
46       Shanta     Vollman             50
47        Susan      Mavris             40

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\1098934241.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query1, connection)

Q10. From the following table, write a SQL query to find departments for a particular location.The location matches the location of the department of ID 30. Return department name and department ID.

In [40]:
query1 = """SELECT department_name, department_id
FROM departments
WHERE location_id = (SELECT location_id 
					FROM departments 
                    WHERE department_id = 30);"""
data = pd.read_sql(query1, connection)
print(data)

         department_name  department_id
0         Administration             10
1             Purchasing             30
2              Executive             90
3                Finance            100
4             Accounting            110
5               Treasury            120
6          Corporate Tax            130
7     Control And Credit            140
8   Shareholder Services            150
9               Benefits            160
10         Manufacturing            170
11          Construction            180
12           Contracting            190
13            Operations            200
14            IT Support            210
15                   NOC            220
16           IT Helpdesk            230
17      Government Sales            240
18          Retail Sales            250
19            Recruiting            260
20               Payroll            270

C:\Users\DELL\AppData\Local\Temp\ipykernel_11680\3910216051.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query1, connection)

In [42]:
connection.close()

# Dictionary

In [46]:
"""
Q1. Write a Python script to add a key to a dictionary.

Sample Dictionary : {0: 10, 1: 20}
Expected Result : {0: 10, 1: 20, 2: 30}

"""
dic= {0: 10, 1: 20}
dic.update({2:30})
dic

{0: 10, 1: 20, 2: 30}

In [50]:
"""
Q2. Write a Python script to concatenate the following dictionaries to create a new one.

Sample Dictionary :
dic1={1:10, 2:20}
dic2={3:30, 4:40}
dic3={5:50,6:60}
Expected Result : {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

"""
dic4= {}

dic1={1:10, 2:20}
dic2={3:30, 4:40}
dic3={5:50,6:60}

for i in (dic1,dic2,dic3):
    dic4.update(i)
print(dic4)

{1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

In [53]:
# Q3. Write a Python program to remove a key from a dictionary.

dic4 = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}
if 1 in dic4:
    del dic4[1]
print(dic4)

{2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

In [57]:
# Q4. Write a Python program to sort a given dictionary by key.

dic4 = {1: 10, 2: 20, 3: 30, 5: 50, 4: 40, 6: 60}
for key in sorted (dic4):
    print("%s:%s" %(key,dic4[key]))

1:10
2:20
3:30
4:40
5:50
6:60

In [65]:
"""
Q5. Write a Python program to create a dictionary from a string.
Note: Track the count of the letters from the string.
Sample string : 'w3resource'
Expected output: {'w': 1, '3': 1, 'r': 2, 'e': 2, 's': 1, 'o': 1, 'u': 1, 'c': 1}

"""
dic6 ={}

string=  'w3resource'
for i in string:
    dic6[i] = dic6.get(i,0)+1
print(dic6)

{'w': 1, '3': 1, 'r': 2, 'e': 2, 's': 1, 'o': 1, 'u': 1, 'c': 1}

In [75]:
"""
Q6. Write a Python program to convert a list of dictionaries into a list of values corresponding to the specified key.
Sample Output:
Original list of dictionaries:
[{'name': 'Theodore', 'age': 18}, {'name': 'Mathew', 'age': 22}, {'name': 'Roxanne', 'age': 20}, {'name': 'David', 'age': 18}]
Convert a list of dictionaries into a list of values corresponding to the specified key:
[18, 22, 20, 18]
"""
list = []
orignal_list = [{'name': 'Theodore', 'age': 18}, {'name': 'Mathew', 'age': 22}, 
                {'name': 'Roxanne', 'age': 20}, {'name': 'David', 'age': 18}]

for i in orignal_list:
    list.append(i['age'])
print(list)

[18, 22, 20, 18]

In [91]:
orignal_list = [{'name': 'Theodore', 'age': 18}, {'name': 'Mathew', 'age': 22}, 
                {'name': 'Roxanne', 'age': 20}, {'name': 'David', 'age': 18}]

In [90]:
orignal_list.clear()

In [96]:
dict5= orignal_list.copy()
print(dict5)

[{'name': 'Theodore', 'age': 18}, {'name': 'Mathew', 'age': 22}, {'name': 'Roxanne', 'age': 20}, {'name': 'David', 'age': 18}]

In [97]:
x = ('key1', 'key2', 'key3')
y = 0

thisdict = dict.fromkeys(x, y)

print(thisdict)

{'key1': 0, 'key2': 0, 'key3': 0}

In [98]:
car = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}

x = car.get("model")

print(x)

Mustang

In [99]:
car = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}

x = car.items()

print(x)

dict_items([('brand', 'Ford'), ('model', 'Mustang'), ('year', 1964)])

In [101]:
car = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}

x = car.keys()

print(x)

dict_keys(['brand', 'model', 'year'])

In [102]:
car.pop("model")

print(car)

{'brand': 'Ford', 'year': 1964}

In [103]:
car = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}

car.popitem()

print(car)

{'brand': 'Ford', 'model': 'Mustang'}

In [105]:
car = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}

car.update({"color": "White"})

print(car)

{'brand': 'Ford', 'model': 'Mustang', 'year': 1964, 'color': 'White'}

In [106]:
car = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}

x = car.values()

print(x)

dict_values(['Ford', 'Mustang', 1964])